nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmkw43/driver_examples/tdet/pin_mux.c
/*
 * Copyright 2026 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: KW43B43ZC7xxx
package_id: KW43B43ZC7MFT
mcu_data: ksdk2_0
processor_version: 0.0.0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '39', peripheral: LPUART_1, signal: RX, pin_signal: PTC2/LPSPI1_SOUT/LPUART1_RX/LPI2C1_SCLS/TPM4_CH1, pull_select: down, pull_enable: disable, slew_rate: fast,
    open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '40', peripheral: LPUART_1, signal: TX, pin_signal: PTC3/LPSPI1_SCK/LPUART1_TX/LPI2C1_SDAS/TPM0_CLKIN, pull_select: down, pull_enable: disable, slew_rate: fast,
    open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '25', peripheral: TDET0, signal: 'TAMPER, 0', pin_signal: ADC0_A14/PTD2/LPTMR0_ALT3/TAMPER0/RF_GPO_5/TPM2_CH0/LPTMR1_TRIG_OUT_b}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortC);

    const port_pin_config_t port_c2_pin39_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = (uint16_t)kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                    /* Pin is configured as LPUART1_RX */
                                                    .mux = (uint16_t)kPORT_MuxAlt3,
                                                    /* Digital input is not inverted */
                                                    .invertInput = (uint16_t)kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_C2 (pin 39) is configured as LPUART1_RX */
    PORT_SetPinConfig(BOARD_INITPINS_DEBUG_UART_RX_PORT, BOARD_INITPINS_DEBUG_UART_RX_PIN, &port_c2_pin39_config);

    const port_pin_config_t port_c3_pin40_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = (uint16_t)kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                    /* Pin is configured as LPUART1_TX */
                                                    .mux = (uint16_t)kPORT_MuxAlt3,
                                                    /* Digital input is not inverted */
                                                    .invertInput = (uint16_t)kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_C3 (pin 40) is configured as LPUART1_TX */
    PORT_SetPinConfig(BOARD_INITPINS_DEBUG_UART_TX_PORT, BOARD_INITPINS_DEBUG_UART_TX_PIN, &port_c3_pin40_config);

    const port_pin_config_t port_d2_pin25_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = (uint16_t)kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                    /* Pin is configured as TAMPER0 */
                                                    .mux = (uint16_t)kPORT_MuxAlt3,
                                                    /* Digital input is not inverted */
                                                    .invertInput = (uint16_t)kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_D2 (pin 25) is configured as TAMPER0 */
    PORT_SetPinConfig(BOARD_INITPINS_TAMPER_0_PORT, BOARD_INITPINS_TAMPER_0_PIN, &port_d2_pin25_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
